

// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборКаметры();
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КамераПриИзменении(Элемент)
	УстановитьОтборКаметры();
КонецПроцедуры

&НаКлиенте
Процедура МарсоходПриИзменении(Элемент)
	УстановитьОтборКаметры();
КонецПроцедуры

&НаКлиенте
Процедура ДатаСнимкаПриИзменении(Элемент)
	УстановитьОтборКаметры();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокФото

&НаКлиенте
Процедура СписокФотоПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокФото.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Картинка = ПолучитьНавигационнуюСсылку(ТекущиеДанные.Ссылка, "file");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборКаметры()
	СписокФото.Параметры.УстановитьЗначениеПараметра("Камера", Камера);
	СписокФото.Параметры.УстановитьЗначениеПараметра("Дата", ДатаСнимка);
КонецПроцедуры

#КонецОбласти
