
#Область ПрограммныйИнтерфейс

// Сообщить пользователю.
// 
// Параметры:
//  ТекстСообщенияПользователю - Строка - Текст сообщения пользователю
//  КлючДанных - Строка, ЛюбаяСсылка  - Ключ данных
//  Поле - Строка - Поле
//  ПутьКДанным - Строка - Путь к данным
//  ЭтоОбъект - Булево - Это объект
Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "") Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	Сообщение.КлючДанных = КлючДанных;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
