#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		МассивПодстрок = СтрРазделить(ДанныеЗаполнения.img_src, "/", Ложь);
		ИмяФото = МассивПодстрок[МассивПодстрок.Количество()-1];
		Наименование = ИмяФото;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли