// @strict-types

#Область ПрограммныйИнтерфейс

// Загрузка снимков за период.
// 
// Параметры:
//  ДатаНачала - Дата - Дата начала
//  ДатаОкончания - Дата - Дата окончания
//  АдресРезультатаФЗ - Строка - Адрес результата ФЗ
Процедура ЗагрузкаСнимковЗаПериод(ДатаНачала, ДатаОкончания, АдресРезультатаФЗ) Экспорт
	
	ДанныеСнимковЗаПериод = Обработки.ЗагрузкаСнимковЗаПериод.ЗагрузитьСнимкиЗаПериод(ДатаНачала, ДатаОкончания);
	
	Результат = Обработки.ЗагрузкаСнимковЗаПериод.ОбработатьПолученыеДанныеСнимков(ДанныеСнимковЗаПериод);
	
	Обработки.ЗагрузкаСнимковЗаПериод.ЗагрузитьФотографии(Результат.МассивНовыхФото);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультатаФЗ)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Структура процесса обработки данных.
// 
// Возвращаемое значение:
//  Структура - Структура процесса обработки данных::
// * ВсегоСнимков - Число -
// * Обработано - Число -
// * НовыеФото - Число -
// * НовыеКамеры - Число -
// * НовыеМарсоходы - Число -
// * Завершено - Булево -
// * ТекстОшибки - Строка -
// * ВсегоДат - Число -
// * ОбработаноДат - Число -
// * ВсегоФотоКЗагрузке - Число -
// * ФотоЗагружено - Число -
// * ПолучениеДанных - Булево -
// * ЗагрузкаФото - Булево -
// * ОбработкаДанных - Булево -
// * МассивНовыхФото - Массив из СправочникСсылка.СнимкиСКамер -    
Функция СтруктураПроцессаОбработкиДанных() Экспорт
	
	Результат = Новый Структура();
	
	Результат.Вставить("ОбработкаДанных", Ложь);
	Результат.Вставить("ВсегоСнимков", 0);
	Результат.Вставить("Обработано", 0);
	Результат.Вставить("НовыеФото", 0);
	Результат.Вставить("НовыеКамеры", 0);
	Результат.Вставить("НовыеМарсоходы", 0);
	Результат.Вставить("Завершено", 	Ложь);
	Результат.Вставить("ТекстОшибки", 	"");
	
	Результат.Вставить("ПолучениеДанных", Ложь);
	Результат.Вставить("ВсегоДат", 0);
	Результат.Вставить("ОбработаноДат", 0);
	
	Результат.Вставить("ЗагрузкаФото", Ложь);
	Результат.Вставить("ВсегоФотоКЗагрузке", 0);
	Результат.Вставить("ФотоЗагружено", 0);
	
	Результат.Вставить("МассивНовыхФото", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти