// @strict-types

#Область ПрограммныйИнтерфейс

// Загрузка снимков за период.
// 
// Параметры:
//  ДатаНачала - Дата - Дата начала
//  ДатаОкончания - Дата - Дата окончания
//  АдресРезультатаФЗ - Строка - Адрес результата ФЗ
Процедура ЗагрузкаСнимковЗаПериод(ДатаНачала, ДатаОкончания, АдресРезультатаФЗ) Экспорт
	
	ДанныеСнимковЗаПериод = Обработки.ЗагрузкаСнимковЗаПериод.ЗагрузитьСнимкиЗаПериод(ДатаНачала, ДатаОкончания);
	
	Результат = Обработки.ЗагрузкаСнимковЗаПериод.ОбработатьПолученыеДанныеСнимков(ДанныеСнимковЗаПериод);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультатаФЗ)
	
КонецПроцедуры

#КонецОбласти
